{
  "navigation": {
    "about": "About",
    "experience": "Experience",
    "skills": "Skills", 
    "projects": "Projects",
    "contact": "Contact"
  },
  "header": {
    "title": "Cristina Diéguez Llaràs",
    "subtitle": "Data Engineer & Visualization Expert"
  },
  "sections": {
    "aboutTitle": "About Me",
    "aboutText": "Telecommunications Engineer with 8+ years of experience in Business Intelligence and Data Engineering. Specialized in data visualization, ETL processes, and analytical solutions across large-scale corporate projects (HP, Puig, Seat, Cosentino, Mutua Universal). Currently expanding skills in Python and backend development, leveraging strong foundation in SQL, data architecture, and problem-solving.",
    "experienceTitle": "Professional Journey",
    "skillsTitle": "Technical Skills",
    "projectsTitle": "Personal Projects",
    "contactTitle": "Contact"
  },
  "timeline": {
    "filters": {
      "all": "All",
      "work": "Work Experience",
      "education": "Education"
    }
  },
  "projects": {
    "intro": "Personal projects developed in my free time to explore new technologies and expand my development skills.",
    "demo": "Live Demo",
    "github": "GitHub",
    "wedding": {
      "title": "Wedding Website",
      "description": "Complete wedding website with RSVP form, photo gallery, and guest management. Frontend connected to Google Sheets using Apps Script for data collection.",
      "link": "View Details"
    },
    "nodejs": {
      "title": "NodeJS + Azure Project",
      "description": "End-to-end web application with SharePoint frontend, custom NodeJS API, and MySQL database hosted on Azure. Implements authentication, CRUD operations, and real-time data synchronization.",
      "link": "View Details"
    },
    "powerbi": {
      "title": "Power BI Advanced Solutions",
      "description": "Collection of advanced Power BI dashboards featuring custom JavaScript visualizations, complex DAX calculations, and innovative data storytelling techniques.",
      "link": "View Details"
    },
    "cv": {
      "title": "Interactive CV",
      "description": "This responsive, multi-language CV built with vanilla JavaScript, featuring theme switching, smooth animations, and professional design patterns.",
      "link": "View Source"
    }
  }
}